---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator
source: html/a85dea53-5d23-5c2a-ecdf-95a502dbfee9.htm
---
# DuctSizeSettingIterator Methods

Identifies whether the iterator has a current item.
 There is no current item if the iterator has not started yet or has been done.